app/graphql/mutations/create_claim.rb

  def resolve(fullname:, reference:, telnumber:, email:, addressline1:, town:, postcode:)
    claim = Claim.new(fullname: fullname, reference: reference, telnumber: telnumber, email: email, addressline1: addressline1, town: town, postcode: postcode)
    if claim.save
---
INSERT INTO "claims" ("fullname", "reference", "telnumber", "email", "addressline1", "town", "postcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"